<#import "parts/common.ftl" as c>

<@c.page>
    <h5>Hello, guest</h5>
    <div>This is a test project from Mikhail Zareev. The text of the assignment in Russian:</div>
    <p>Спроектировать и реализовать Web-приложение на Java, выполняющее следующие функции:</p>
    <p>1) Ведение справочников групп студентов и учебных предметов</p>
    <p>2) Ведение списка студентов (фамилия, имя, отчество, дата рождения, группа)</p>
    <p>3) Ведение списка преподавателей (фамилия, имя, отчество, набор предметов, которые он ведет)</p>
    <p>4) Регистрация показателей успеваемости (студент, предмет, преподаватель, оценка)</p>
    <p>5) Вывод информации о лидерах и отстающих (по 3 человека) по среднему баллу по всем предметам</p>
</@c.page>
